---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofEaveCutParam
source: html/1cd7cd62-2b17-c2ec-b2f3-f5fe1efa7a38.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofEaveCutParam Property

"Rafter Cut"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofEaveCutParam { get; }
```